test/artillery.yaml
#----- GET QUESTIONS -----
# config:
#   target: "http://localhost:3000"
#   phases:
#     - duration: 60
#       arrivalRate: 5
#       rampTo: 10
#     - duration: 60
#       arrivalRate: 10
#       rampTo: 50
#     - duration: 300
#       rampTo: 50
# scenarios:
  # - name: Get questions for a product
  #   flow:
  #     - get:
  #         url: "/qa/questions?product_id=1"
  #     - get:
  #         url: "/qa/questions?product_id=2"
  #     - get:
  #         url: "/qa/questions?product_id=3"

#----- GET ANSWERS -----
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
    - duration: 60
      arrivalRate: 10
      rampTo: 50
    - duration: 300
      rampTo: 50
scenarios:
  - name: Get answers for a question
    flow:
      - get:
          url: "/qa/questions/1/answers"
      - get:
          url: "/qa/questions/2/answers"
      - get:
          url: "/qa/questions/3/answers"